
## Plan Result (stg)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 0 to change, 4 to destroy.</code></pre>

* Create
  * module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql.null_resource.set-user-permissions-additionaldbs[&#34;rota&#34;]
* Replace
  * module.postgresql.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases[&#34;rota&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.postgresql.azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      - administrator_password_wo_version = 0 -> null
      ~ fqdn                              = "rota-null-stg.postgres.database.azure.com" -> (known after apply)
      ~ id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/rota-shared-infra-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/rota-null-stg" -> (known after apply)
      ~ name                              = "rota-null-stg" -> "rota-psql-stg" # forces replacement
      ~ storage_tier                      = "P6" -> (known after apply)
        tags                              = {
            "application"         = "rota"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/rota-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#rota-builds"
            "environment"         = "staging"
            "managedBy"           = "Magistrates Rota"
        }
      - zone                              = "1" -> null
        # (16 unchanged attributes hidden)

      ~ high_availability {
          - standby_availability_zone = "2" -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin must be replaced
-/+ resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      ~ id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/rota-shared-infra-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/rota-null-stg/administrators/e7ea2042-4ced-45dd-8ae3-e051c6551789" -> (known after apply)
      ~ server_name         = "rota-null-stg" -> "rota-psql-stg" # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      ~ id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/rota-shared-infra-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/rota-null-stg/administrators/7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01" -> (known after apply)
      ~ server_name         = "rota-null-stg" -> "rota-psql-stg" # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases["rota"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/rota-shared-infra-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/rota-null-stg/databases/rota" -> (known after apply)
        name      = "rota"
      ~ server_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/rota-shared-infra-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/rota-null-stg" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql.null_resource.set-user-permissions-additionaldbs["rota"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS SDS DB Access Reader"
          + "force_trigger"  = null
          + "name"           = "rota-psql"
          + "script_hash"    = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
        }
    }

Plan: 6 to add, 0 to change, 4 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":3,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->